In [9]:
d = {'name':['ao','wa','yeah'],'gender':['female','male','male'],'age':[18,20,30]}

In [10]:
import pandas as pd
df = pd.DataFrame(d)

In [11]:
df

   name  gender  age
0    ao  female   18
1    wa    male   20
2  yeah    male   30

In [13]:
#里面是返回series的判断，外面才是索引
df[df['age'] == 18]

  name  gender  age
0   ao  female   18

In [19]:
df[df.age>18]

   name gender  age
1    wa   male   20
2  yeah   male   30

In [23]:
#(df.age ==18)|(df.name =='ao') |是或者
df[(df.age ==18)&(df.name =='ao')]

  name  gender  age
0   ao  female   18

In [31]:
df.query("(age==18)&(gender =='female')")

  name  gender  age
0   ao  female   18

In [32]:
df.age = df.age+1

In [33]:
df

   name  gender  age
0    ao  female   19
1    wa    male   21
2  yeah    male   31

In [34]:
#iloc针对索引，loc针对标签
df.iloc[1]

name        wa
gender    male
age         21
Name: 1, dtype: object

In [37]:
df.index=list('abc')

In [38]:
df.loc['a']

name          ao
gender    female
age           19
Name: a, dtype: object

In [40]:
df

   name  gender  age
a    ao  female   19
b    wa    male   21
c  yeah    male   31

In [44]:
df.iloc[0:2,0:3]

  name  gender  age
a   ao  female   19
b   wa    male   21

In [45]:
df.loc['a',['age','name']]

age     19
name    ao
Name: a, dtype: object

In [46]:
#找到age为19的行，行内的哪些列。
df.loc[ df.age==19 ,'age']

a    19
Name: age, dtype: int64

In [50]:
#根据找到的值，进行重新赋值
df.loc[ df.age==19 ,'age'] = 20

In [51]:
df

   name  gender  age
a    ao  female   20
b    wa    male   21
c  yeah    male   31

In [52]:
df.index = [0,1,2]

In [54]:
df.loc[0:2,'name']

0      ao
1      wa
2    yeah
Name: name, dtype: object